
import 'dart:js';

import 'package:taejai/pages/project/projec_detail_page.dart';

import '';
import 'package:flutter/material.dart';
import '../../models/project.dart';
import 'package:intl/intl.dart';
// ignore_for_file: prefer_const_constructors
class ProjectListPage extends StatefulWidget {
  const ProjectListPage({Key? key}) : super(key: key);

  @override
  State<ProjectListPage> createState() => _ProjectListPageState();
}

class _ProjectListPageState extends State<ProjectListPage> {
  List<Project> projects = [
    Project(
      title: 'ทวีปที่ใหญ่ที่สุดในโลก',
      ans: "เอเชีย",
      fullDescription: 'เอเชีย (อังกฤษ: Asia; กรีก: Ασία อาเซีย) เป็นทวีปขนาดใหญ่และมีประชากรมากที่สุดในโลก พื้นที่ส่วนมากตั้งอยู่ในซีกโลกเหนือและซีกโลกตะวันออก ทวีปเอเชียเป็นส่วนหนึ่งของทวีปยูเรเชียรวมกับทวีปยุโรป และเป็นส่วนหนึ่งของทวีปแอฟโฟร-ยูเรเชียร่วมกับยุโรปและแอฟริกา ทวีปเอเชียมีพื้นที่ทั้งหมดประมาณ 44,579,000 ตารางกิโลเมตร คิดเป็น 30% ของแผ่นดินทั่วโลกหรือคิดเป็น 8.7% ของผิวโลกทั้งหมด ทวีปเอเชียเป็นที่อยู่อาศัยของมนุษย์มานานและเป็นแหล่งกำเนิดอารยธรรมแรก ๆ ของโลกหลายแห่ง เอเชียไม่ได้เป็นเพียงทวีปขนาดใหญ่และมีประชากรเยอะ แต่ยังมีสถานที่และการตั้งถิ่นฐานหนาแน่นมีขนาดใหญ่ แต่เช่นเดียวกันทวีปเอเชียก็มีบริเวณที่มีประชากรเบาบางด้วย ทั้งนี้ทวีปเอเชียมีประชากรราว 4.5 พันล้านคน (ข้อมูลเมื่อ มิถุนายน 2019) คิดเป็น 60% ของประชากรโลก',
      imageURL: 'assets/images/1.jpg',
      imageURLIn: "assets/images/11.jpg",
    ),
    Project(
      title: 'แม่น้ำที่กว้างที่สุดในโลก',
      ans: "แม่น้ำแอมะซอน",
      fullDescription: 'แม่น้ำแอมะซอน (อังกฤษ: Amazon River; โปรตุเกส: Rio Amazonas; สเปน: Río Amazonas) เป็นแม่น้ำในทวีปอเมริกาใต้ มีต้นกำเนิดอยู่ที่ประเทศเปรู ไหลผ่านประเทศโคลอมเบีย และไหลออกมหาสมุทรแอตแลนติกที่ประเทศบราซิล มีความยาวทั้งสิ้นประมาณ 6,992 กิโลเมตร เป็นแม่น้ำที่มีปากแม่น้ำกว้างที่สุดในโลก ซึ่งอยู่บริเวณทางเหนือของบราซิล แม่น้ำแอมะซอนเป็นแม่น้ำสายที่มีปริมาณน้ำมากที่สุด ในฤดูฝน ปริมาณน้ำที่ไหลออกยังมหาสมุทรแอตแลนติกมากถึง 45 ล้านแกลลอนต่อวินาที ฝนที่ตกในลุ่มแม่น้ำแอมะซอนเฉลี่ยปีละ 3 เมตร (สูงสุด 6 เมตร) แต่ฝนจะตกเพียงไม่กี่เดือน ต่างกันไปตามแต่ละสถานที่ ในช่วงฤดูแล้งราวเดือนตุลาคม น้ำจะลดปริมาณลงจนเห็นสันทรายและเกิดเป็นทะเลสาบต่าง ๆ บางแห่งตัดขาดจากกัน ในฤดูน้ำหลากน้ำจะท่วมป่าทุกปี ในเนื้อที่ประมาณ 350,000 ตารางกิโลเมตร ขนาดเท่าประมาณประเทศเยอรมนี และยังถือเป็นแม่น้ำที่มีปริมาณน้ำมากถึง 1 ใน 5 ส่วนของโลก มีแม่น้ำสาขาที่แยกออกจากแอมะซอนมากกว่า 1,100 สาขา อีกทั้งยังถือเป็นแม่น้ำที่มีความหลากหลายทางชีวภาพมากที่สุดในโลก เป็นแม่น้ำที่มีความหลากหลายทางชนิดพันธุ์ปลามากที่สุดในโลก กว่า 5,600 ชนิด ซึ่งนับว่ามากกว่ามหาสมุทรแอตแลนติกเสียอีก ในทุก ๆ ปี จะมีการค้นพบปลาสายพันธุ์ใหม่ที่แม่น้ำแห่งนี้ถึงปีละ 50 ชนิด',
      imageURL: 'assets/images/2.jpg',
      imageURLIn: "assets/images/22.jpg",
    ),
    Project(
      title: 'ภูเขาไฟที่สวยและสูงที่สุดในโลก',
      ans: "ภูเขาไฟฟูจิยามา ประเทศญี่ปุ่น",
      fullDescription: 'ภูเขาไฟฟูจิ (Fuji Mountain) เป็นภูเขาที่สูงที่สุดใน ประเทศญี่ปุ่น ราว 3,776 เมตร (12,388 ฟุต) ตั้งอยู่บริเวณจังหวัดชิซูโอกะและจังหวัดยามานาชิ ซึ่งอยู่ทางตะวันตกของ โตเกียว พื้นที่โดยรอบประกอบด้วย ทะเลสาบฟูจิทั้งห้า อุทยานแห่งชาติฟูจิ-ฮาโกเนะ-อิซุ และน้ำตกชิราอิโตะ โดยในวันที่อากาศแจ่มใสสามารถมองเห็นจากโตเกียวได้ ในปัจจุบันภูเขาได้ถูกจัดโดยนักวิทยาศาสตร์อยู่ในลักษณะของภูเขาไฟที่มีโอกาสปะทุต่ำ ระเบิดครั้งล่าสุดใน พ.ศ. 2250 (ค.ศ. 1707) ยุคเอโดะ ภูเขาไฟฟูจิ มีชื่อในภาษาญี่ปุ่นว่า ฟูจิซัง ซึ่งในหนังสือในสมัยก่อนเรียกว่า ฟูจิยามะ เนื่องจากตัวอักษรคันจิตัวที่ 3 (山) สามารถอ่านได้ 2 แบบทั้ง ยามะ และ ซัง ',
      imageURL: 'assets/images/3.jpg',
      imageURLIn: "assets/images/33.jpg",
    ),
    Project(
      title: 'ประเทศที่พลเมืองมากที่สุดในโลก',
      ans: "จีน",
      fullDescription: 'สาธารณรัฐประชาชนจีน (จีนตัวย่อ: 中华人民共和国; จีนตัวเต็ม: 中華人民共和國; พินอิน: Zhōnghuá Rénmín Gònghéguó; อังกฤษ: People\'s Republic of China (PRC)) เป็นรัฐเอกราชในเอเชียตะวันออก เป็นประเทศที่มีประชากรมากที่สุดในโลก กว่า 1,400 ล้านคน เป็นรัฐพรรคการเมืองเดียวปกครองโดยพรรคคอมมิวนิสต์จีน มีเมืองหลวงอยู่ที่กรุงปักกิ่ง ประเทศจีนแบ่งการปกครองออกเป็น 22 มณฑล (ไม่รวมพื้นที่พิพาทไต้หวัน), 5 เขตปกครองตนเอง, 4 นครปกครองโดยตรง (ปักกิ่ง เทียนจิน เซี่ยงไฮ้ และฉงชิ่ง), และ 2 เขตบริหารพิเศษ ได้แก่ฮ่องกงและมาเก๊า',
      imageURL: 'assets/images/4.jpg',
      imageURLIn: "assets/images/44.jpg",
    ),
    Project(
      title: 'ประเทศที่ปลูกกาแฟมากที่สุด',
      ans: "บราซิล",
      fullDescription: 'บราซิล ( Brazil ) นอกจากจะเป็นเจ้าแห่งแชมป์ฟุตบอลโลกแล้ว บราซิลยังครองแชมป์การผลิตกาแฟมากที่สุดในโลกอีกด้วย โดยสามารถผลิตได้มากกว่า 2,964 ล้านกิโลกรัม/ปี โดยจะเป็นการผลิตกาแฟแบบแห้งคือใช้วิธีตากแดดกาแฟในบราซิลปลูกกัน 2 สายพันธุ์หลักๆ ได้แก่ อาราบิก้าและโรบัสต้า โดยพันธุ์อาราบิก้านั้นปลูกกันมากถึง 80 เปอร์เซ็นต์ พื้นที่ทางตอนใต้ของประเทศได้ชื่อว่าเป็นแหล่งปลูกกาแฟอาราบิก้าคุณภาพสูง ส่วนสายพันธุ์โรบัสต้านั้น ปลูกกันราว 20 เปอร์เซ็นต์ เน้นส่งออกเพื่อแปรรูปเป็นกาแฟสำเร็จรูป',
      imageURL: 'assets/images/5.jpg',
      imageURLIn: "assets/images/55.jpg",
    ),
    Project(
      title: 'คนที่ให้รถทับตัวได้เยอะที่สุดในโลก',
      ans: "Tom Owen",
      fullDescription: 'Tom Owen คือหนุ่มนักเพาะกายที่สามารถนอนให้รถทับร่างได้เยอะมากที่สุดในโลก ในปี 2009 ที่กรุงมิลาน ประเทศอิตาลี เขาให้รถปิ๊กอัพน้ำหนัก 3.3 ถึง 4.41 ตัน จำนวน 9 คันขับผ่านท้องของเขาไป โดยเขาสามารถทนรับแรงกดนั้นได้ด้วยกล้ามหน้าท้องที่ทำหน้าที่เหมือนกับหมอนคอยรองรับอย่างไรก็ตาม Tom ได้รับอาการบาดเจ็บจากความบ้าระห่ำของเขา กระดูกซี่โครงหักและมีเลือดออกภายใน แต่ถึงอย่างไรเขาก็รอดมาได้แหละนะ',
      imageURL: 'assets/images/6.jpg',
      imageURLIn: "assets/images/66.jpg",
    ),
    Project(
      title: 'คนที่สะอึกนานที่สุดในโลก',
      ans: "Charles Osborne",
      fullDescription: 'Charles Osborne เริ่มสะอึกตอนปี 1922 แล้วมาหยุดสะอึกในปี 1990 รวมเป็นระยะเวลา 68 ปีที่เขาสะอึกไม่หยุด ในช่วงแรก Charles สะอึกประมาณ 40 ครั้งต่อนาที จนกระทั่งผ่านไปหลายทศวรรษมันถึงได้ลดลงเหลือประมาณ 20 ครั้งต่อนาที',
      imageURL: 'assets/images/7.jpg',
      imageURLIn: "assets/images/77.jpg",
    ),
    Project(
      title: 'คนที่หนักที่สุดในโลก',
      ans: "Jon Brower Minnoch",
      fullDescription: 'จากสถิติล่าสุด มีคนจำนวนกว่า 2 พันล้านคนทั่วโลกที่กำลังประสบปัญหากับโรคอ้วนและน้ำหนักเกิน โดยคนที่มีน้ำหนักมากที่สุดในโลกนั้นคือ Jon Brower Minnoch ผู้มีปัญหาเกี่ยวกับความอ้วนที่ผิดปกติตั้งแต่ยังเป็นเด็ก เขาเคยหนักสุดที่ 635 กิโลกรัมเลยทีเดียวแต่หลังจากนั้นเขาก็สามารถลดน้ำหนักลงมาเหลือ 215 กิโลกรัมในระยะเวลา 2 ปี ด้วยการควบคุมการบริโภค กินแค่วันละ 1,200 แคลลอรี่ น่าเศร้าที่สุดท้ายเขาก็จากโลกนี้ไปในวันที่ 10 กันยายน 1983 ด้วยน้ำหนักตัว 361 กิโลกรัม',
      imageURL: 'assets/images/8.jpg',
      imageURLIn: "assets/images/88.jpg",
    ),
    Project(
      title: 'คนที่โดดน้ำสูงที่สุดในโลก',
      ans: "Cascade de Salto",
      fullDescription: 'ในปี 2015 Laso Schaller ทำการโดดลงมาจากเหนือน้ำตก Cascade de Salto ซึ่งมีความสูงถึง 59 เมตร หรือสูงประมาณตึก 16 ชั้น ทำให้เขากระทบกับผิวน้ำด้วยความเร็ว 122 กิโลเมตรต่อชั่วโมง การบันทึกสถิติครั้งนี้ทำให้กระดูกสะโพกของเขาหลุด แต่ก็รอดชีวิตมาได้อย่างไม่น่าเชื่อ',
      imageURL: 'assets/images/9.jpg',
      imageURLIn: "assets/images/99.jpg",
    ),
    Project(
      title: 'คนที่ปากกว้างที่สุดในโลก ',
      ans: "Isaac Johnson",
      fullDescription: 'Isaac Johnson วัยรุ่นหนุ่มจากรัฐมินนิโซตา สหรัฐอเมริกาสร้างสถิติอ้าปากกว้างที่สุดในโลก โดยวัดได้ที่ 10.175 เซนติเมตร และบันทึกลงกินเนสส์ เวิร์ลด์เรคคอร์ด (Guinness World Records)  เป็นที่เรียบร้อยแต่เดิมเขาไม่ได้อ้าปากได้กว้างขนาดนี้ เมื่อโตขึ้น ความกว้างของปาก Isaac ก็เพิ่มขึ้นจนทุบสถิติเดิมของ Phillip Angus ที่วัดได้ 9.52 เซนติเมตร ในปี ค.ศ.2019 ลงได้  ทำให้เขาตัดสินใจติดต่อไปยังกินเนสส์ เวิร์ลด์เรคคอร์ด (Guinness World Records) เพื่อจะได้ทำการวัดและบันทึกชื่อของเขาให้โลกได้รับรู้ หลังทำการวัดได้ 10.175 เซนติเมตร  Isaac จึงได้รับการบันทึกว่า เป็นเด็กชายที่อ้าปากได้กว้างที่สุดในโลกสำเร็จหากต้องอธิบายว่าเขาอ้าปากได้กว้างเท่าไหร่ให้เห็นภาพ คงต้องเล่าผ่านของที่สามารถใส่ในปากของ Isaac ได้แก่ ลูกเบสบอล กระป๋องโซดา แอปเปิล หรือแฮมเบอร์เกอร์ที่วางซ้อนกันได้ 4-5 ชิ้นหลายคนอาจสงสัยว่าอ้าปากกว้างขนาดนี้จะเจ็บไหมนะ แต่เขาตอบกลับว่านี่เป็นพรสวรรค์ ไม่ได้เป็นการฝืนหรือทรมานร่างกายแต่อย่างใด ปัจจุบัน Isaac มีชื่อเสียงโด่งดังพอตัวทีเดียว โดยวีดีโอทดสอบความกว้างการอ้าปากของเขาบน TikTok ช่อง  Guinness World Records มียอดวิวมากกว่า 77 ล้านแล้ว และเวลาออกไปข้างนอกก็มีคนจำเขาได้ด้วย',
      imageURL: 'assets/images/10.jpg',
      imageURLIn: "assets/images/1010.jpg",
    ),
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("ที่สุดของโลก"),
      ),
      body: ListView.builder(
        itemCount: projects.length,
        itemBuilder: (BuildContext context, int index) {
          var myTextStyle = TextStyle(fontSize: 19, color: Colors.black54);
          var src = projects[index].imageURL;
          return Padding(
            padding: const EdgeInsets.fromLTRB(8, 4, 8, 4),
            child: Card(
              child: InkWell(onTap: (){_handleClickProjectItem(context,projects[index]);},
                child: Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Column(
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: [

                      Row(
                        children: [
                          Image.asset(src,fit: BoxFit.cover,width: 60,height: 60, ),
                          Container(width: 10.0,),
                          Expanded(
                            child: Column(crossAxisAlignment: CrossAxisAlignment.start,
                              children: [
                                SizedBox(height: 8.0),
                                Text(
                                  projects[index].title,
                                  style: TextStyle(fontSize: 24),
                                  overflow: TextOverflow.ellipsis,
                                ),
                                Text("คุณรู้หรือไม่ "+projects[index].title+"คือ...", style: myTextStyle,overflow: TextOverflow.ellipsis,),
                                SizedBox(height: 8.0),
                              ],
                            ),
                          ),
                        ],
                      ),

                    ],
                  ),
                ),
              ),
            ),
          );
        },
      ),
    );
  }

  void _handleClickProjectItem(BuildContext context,Project p){
    print(p.imageURL);
    Navigator.push(context,
      MaterialPageRoute(builder: (context) => ProjectDetailsPage(project: p,)),
    );
  }

}

